## The purpose of this Jupyter Notebook is to create a complete list of ICSEA scores which will be used for all the schools in our datasets from 2016-2019

In [17]:
# import the required library
import pandas as pd

In [18]:
# get the 2019 url WA school ranking
rank_2019 = "https://bettereducation.com.au/school/secondary/wa/wa_top_secondary_schools.aspx?yr=2019"

# Use panda's `read_html` to parse the 2019 ranking url where the ICSEA scores are listed (years 2016 to 2018 have no ICSEA scores)
hs_wa_2019 = pd.read_html(rank_2019, header=0)[0]
hs_wa_2019

,School,Postcode,State Overall Score,English,Maths,Total Enrolments,Trend / Compare,Sector,ICSEA
0,Perth Modern School,6008,100,NaN,NaN,1418,Trend / Compare,Government,1239.0
1,"St Hilda's Anglican School for Girls (Inc),Mos...",6012,100,NaN,NaN,1087,Trend / Compare,Non-government,1197.0
2,Christ Church Grammar School,6010,100,NaN,NaN,1646,Trend / Compare,Non-government,1180.0
3,Rossmoyne Senior High School,6148,100,NaN,NaN,2188,Trend / Compare,Government,1121.0
4,"St Mary's Anglican Girls' School (Inc),Karriny...",6018,100,NaN,NaN,1414,Trend / Compare,Non-government,1158.0
...,...,...,...,...,...,...,...,...,...
89,"Swan Valley Anglican Community School,Aveley,W...",6069,90,NaN,NaN,1031,Trend / Compare,Non-government,1045.0
90,Boyup Brook District High School,6244,90,NaN,NaN,162,Trend / Compare,Government,1002.0
91,"Mater Dei College,Edgewater,WA,6027",6027,90,NaN,NaN,804,Trend / Compare,Non-government,1055.0
92,"Emmanuel Catholic College,Beeliar,WA,6164",6164,90,NaN,NaN,1061,Trend / Compare,Non-government,1036.0
93,Emmanuel Christian Community School,6064,90,NaN,NaN,552,Trend / Compare,Non-government,980.0

In [19]:
# replace the values of "Australian Islamic College" to correct the spelling to prevent Null values when performing the merge with other Dataframes later on
hs_wa_2019["School"].replace({"Australian Islamic College (Kewdale),Kewdale,WA,6105": "Australian Islamic College - Kewdale",
                              "Australian Islamic College (Thornlie),Thornlie,WA,6108": "Australian Islamic College - Thornlie"
                                    }, inplace=True)

In [20]:
# Convert the values in the "ICSEA" column to a String
hs_wa_2019["ICSEA"] = hs_wa_2019["ICSEA"].astype(str)

# Remove other strings before "." to show only the ICSEA values
hs_wa_2019["ICSEA"] = hs_wa_2019["ICSEA"].str.split('.', 1).str.get(0)
hs_wa_2019

,School,Postcode,State Overall Score,English,Maths,Total Enrolments,Trend / Compare,Sector,ICSEA
0,Perth Modern School,6008,100,NaN,NaN,1418,Trend / Compare,Government,1239
1,"St Hilda's Anglican School for Girls (Inc),Mos...",6012,100,NaN,NaN,1087,Trend / Compare,Non-government,1197
2,Christ Church Grammar School,6010,100,NaN,NaN,1646,Trend / Compare,Non-government,1180
3,Rossmoyne Senior High School,6148,100,NaN,NaN,2188,Trend / Compare,Government,1121
4,"St Mary's Anglican Girls' School (Inc),Karriny...",6018,100,NaN,NaN,1414,Trend / Compare,Non-government,1158
...,...,...,...,...,...,...,...,...,...
89,"Swan Valley Anglican Community School,Aveley,W...",6069,90,NaN,NaN,1031,Trend / Compare,Non-government,1045
90,Boyup Brook District High School,6244,90,NaN,NaN,162,Trend / Compare,Government,1002
91,"Mater Dei College,Edgewater,WA,6027",6027,90,NaN,NaN,804,Trend / Compare,Non-government,1055
92,"Emmanuel Catholic College,Beeliar,WA,6164",6164,90,NaN,NaN,1061,Trend / Compare,Non-government,1036
93,Emmanuel Christian Community School,6064,90,NaN,NaN,552,Trend / Compare,Non-government,980

In [21]:
# Remove the strings after the "," to show only the school name
hs_wa_2019["School"] = hs_wa_2019["School"].str.split(',', 1).str.get(0)
hs_wa_2019

,School,Postcode,State Overall Score,English,Maths,Total Enrolments,Trend / Compare,Sector,ICSEA
0,Perth Modern School,6008,100,NaN,NaN,1418,Trend / Compare,Government,1239
1,St Hilda's Anglican School for Girls (Inc),6012,100,NaN,NaN,1087,Trend / Compare,Non-government,1197
2,Christ Church Grammar School,6010,100,NaN,NaN,1646,Trend / Compare,Non-government,1180
3,Rossmoyne Senior High School,6148,100,NaN,NaN,2188,Trend / Compare,Government,1121
4,St Mary's Anglican Girls' School (Inc),6018,100,NaN,NaN,1414,Trend / Compare,Non-government,1158
...,...,...,...,...,...,...,...,...,...
89,Swan Valley Anglican Community School,6069,90,NaN,NaN,1031,Trend / Compare,Non-government,1045
90,Boyup Brook District High School,6244,90,NaN,NaN,162,Trend / Compare,Government,1002
91,Mater Dei College,6027,90,NaN,NaN,804,Trend / Compare,Non-government,1055
92,Emmanuel Catholic College,6164,90,NaN,NaN,1061,Trend / Compare,Non-government,1036
93,Emmanuel Christian Community School,6064,90,NaN,NaN,552,Trend / Compare,Non-government,980

In [22]:
# Remove the "space" and "string inside parenthesis" to show only the school name
hs_wa_2019["School"] = hs_wa_2019["School"].str.split('\s+\(', 1).str.get(0)
hs_wa_2019

,School,Postcode,State Overall Score,English,Maths,Total Enrolments,Trend / Compare,Sector,ICSEA
0,Perth Modern School,6008,100,NaN,NaN,1418,Trend / Compare,Government,1239
1,St Hilda's Anglican School for Girls,6012,100,NaN,NaN,1087,Trend / Compare,Non-government,1197
2,Christ Church Grammar School,6010,100,NaN,NaN,1646,Trend / Compare,Non-government,1180
3,Rossmoyne Senior High School,6148,100,NaN,NaN,2188,Trend / Compare,Government,1121
4,St Mary's Anglican Girls' School,6018,100,NaN,NaN,1414,Trend / Compare,Non-government,1158
...,...,...,...,...,...,...,...,...,...
89,Swan Valley Anglican Community School,6069,90,NaN,NaN,1031,Trend / Compare,Non-government,1045
90,Boyup Brook District High School,6244,90,NaN,NaN,162,Trend / Compare,Government,1002
91,Mater Dei College,6027,90,NaN,NaN,804,Trend / Compare,Non-government,1055
92,Emmanuel Catholic College,6164,90,NaN,NaN,1061,Trend / Compare,Non-government,1036
93,Emmanuel Christian Community School,6064,90,NaN,NaN,552,Trend / Compare,Non-government,980

In [23]:
# re-arrange the columns & remove other columns
icsea = hs_wa_2019[['School', 'ICSEA']]
icsea

                                   School ICSEA
0                     Perth Modern School  1239
1    St Hilda's Anglican School for Girls  1197
2            Christ Church Grammar School  1180
3            Rossmoyne Senior High School  1121
4        St Mary's Anglican Girls' School  1158
..                                    ...   ...
89  Swan Valley Anglican Community School  1045
90       Boyup Brook District High School  1002
91                      Mater Dei College  1055
92              Emmanuel Catholic College  1036
93    Emmanuel Christian Community School   980

[94 rows x 2 columns]

In [24]:
# create a new Dataframe with new entries to be added to the "icsea" Dataframe since they do not exist
icsea_update = pd.DataFrame({"School": ["Heritage College Perth", "Alkimos Baptist College", "Margaret River Senior High School",
                             "Bunbury Catholic College", "Kalbarri District High School",  "Tranby College", "Landsdale Christian School",
                             "Australian Islamic College - Dianella", "Kearnan College", "Bruce Rock District High School", "Shark Bay School",
                             "Pemberton District High School", "Bunbury John Calvin School", "St Joseph's College", "Exmouth District High School",
                             "Seton Catholic College", "Mandurah Baptist College", "John Wollaston Anglican Community School", "Bunbury Senior High School"],
                           "ICSEA": [1028, 1035, 1037, 1035, 988, 1066, 1036, 972, 1025, 952, 945, 990, 1035, 1033, 1016, 1038, 1051, 1054, 1019]
                            })
icsea_update

                                      School  ICSEA
0                     Heritage College Perth   1028
1                    Alkimos Baptist College   1035
2          Margaret River Senior High School   1037
3                   Bunbury Catholic College   1035
4              Kalbarri District High School    988
5                             Tranby College   1066
6                 Landsdale Christian School   1036
7      Australian Islamic College - Dianella    972
8                            Kearnan College   1025
9            Bruce Rock District High School    952
10                          Shark Bay School    945
11            Pemberton District High School    990
12                Bunbury John Calvin School   1035
13                       St Joseph's College   1033
14              Exmouth District High School   1016
15                    Seton Catholic College   1038
16                  Mandurah Baptist College   1051
17  John Wollaston Anglican Community School   1054
18                Bunbury Senior High School   1019

In [25]:
# Merge by concat the "icsea" Dataframe with "icsea_update" Dataframe
icsea_full = pd.concat([icsea, icsea_update])

In [26]:
# Display the merged Dataframe
icsea_full

                                      School ICSEA
0                        Perth Modern School  1239
1       St Hilda's Anglican School for Girls  1197
2               Christ Church Grammar School  1180
3               Rossmoyne Senior High School  1121
4           St Mary's Anglican Girls' School  1158
..                                       ...   ...
14              Exmouth District High School  1016
15                    Seton Catholic College  1038
16                  Mandurah Baptist College  1051
17  John Wollaston Anglican Community School  1054
18                Bunbury Senior High School  1019

[113 rows x 2 columns]

In [27]:
# Check for duplicates
icsea_full[icsea_full.duplicated(keep=False)]

Empty DataFrame
Columns: [School, ICSEA]
Index: []

In [28]:
# check for "nan" values which is a known value in the 2019 rankings dataset for Woodthorpe School
# "nan" values are not considered Null (as opposed to "Nan") so it has to be searched manually
icsea_full.loc[icsea_full["ICSEA"] == "nan", :]

               School ICSEA
34  Woodthorpe School   nan

In [29]:
# replaced "nan" with 983 which is the ICSEA score for Woodthorpe School
icsea_full = icsea_full.replace('nan', 983)

In [30]:
# check for "nan" values after replacing the value to double check
icsea_full.loc[icsea_full["ICSEA"] == "nan", :]

Empty DataFrame
Columns: [School, ICSEA]
Index: []

In [31]:
# replace some values to correct the spelling# replace some values to correct the spelling to prevent Null values when performing the merge with other Dataframes later on
icsea_full["School"].replace({"John Curtin College Of The Arts": "John Curtin College of the Arts", 
                       "Australian Christian College": "Australian Christian College - Southlands",
                       "St Stephen's School": "St Stephen's School - Duncraig",
                       "Schools Of Isolated & Distance Education": "School of Isolated and Distance Education",
                       "St Mary MacKillop College": "St Mary Mackillop College"
                        }, inplace=True)

In [32]:
# save the "icsea_full" Dataframe to a CSV file
icsea_full.to_csv("Resources/icsea_full.csv", index = False)